import X from '../../component/X';

export default function Blog() {
    return (
        <X.BlogWrapper>
            <X.Title>测试Blog</X.Title>
            <X.H1>基础组件</X.H1>
            <X.H2>段落</X.H2>
            <X.P>
                夜晚的城市灯光璀璨夺目，高楼的霓虹灯在黑夜中闪烁不停，像是星空中的繁星在闪烁。\n
                摩天轮缓缓转动，将人们带入一个绚丽多彩的世界，让他们忘记日常的烦忧。\n
                购物中心里，五颜六色的商品琳琅满目，人们拿着购物袋匆匆穿梭，寻找着自己心仪的物品。时尚与潮流在这里汇聚，流行的节奏从不停歇。
                浓郁的咖啡香气弥漫开来，与人们的谈笑声交织成一幅城市特有的画面。街头艺人弹奏着吉他，歌声飘荡在空气中，与城市的脉搏合奏出一曲动人的旋律。
            </X.P>
            <X.H2>二级标题</X.H2>
        </X.BlogWrapper>
    );
}
